#include "EffectObj.h"
#include "ModelManager.h"
#include "GameScene.h"
#include"EffectObjManager.h"

//---------------------------------------------------------------------------------------
//コンストラクタ
//---------------------------------------------------------------------------------------
CEffectObj::CEffectObj(CGameScene *pScene):
CMeshObj(pScene),
m_nLifeTime(OBJ_LIFE)
{
	//自身の番号を設定
	m_nEffectID = CEffectObjManager::GetEffectNumber();

	//次のエフェクト番号の設定
	CEffectObjManager::SetEffectNumber(m_nEffectID + 1);

	//マネージャーに追加
	CEffectObjManager::Add(m_nEffectID,this);
}

//---------------------------------------------------------------------------------------
//デストラクタ
//---------------------------------------------------------------------------------------
CEffectObj::~CEffectObj(void)
{
}

//---------------------------------------------------------------------------------------
//更新
//---------------------------------------------------------------------------------------
void CEffectObj::Update()
{
	//生存時間を減算
	m_nLifeTime --;

	//親関数の更新
	CMeshObj::Update();
}
//---------------------------------------------------------------------------------------
//終了処理
//---------------------------------------------------------------------------------------
void CEffectObj::Fin()
{
	//親の終了処理
	CMeshObj::Fin();
}