#include "Fade.h"
#include "TextureManager.h"


//---------------------------------------------------------------------------------------
//コンストラクタ
//---------------------------------------------------------------------------------------
CFade::CFade(void)
{
	//描画フラグ初期化
	m_bDrawFlg = false;

	//描画時間初期化
	m_nFadeTime = 0;

	//テクスチャの設定
	m_nTextureID = TEXTURE_IN_THE_WALL;
}


//---------------------------------------------------------------------------------------
//デストラクタ
//---------------------------------------------------------------------------------------
CFade::~CFade(void)
{
}

//---------------------------------------------------------------------------------------
//更新
//---------------------------------------------------------------------------------------
void CFade::Update()
{
	//もし、描画残り時間が残っていれば、その時間を減らす
	if(m_nFadeTime <= 255)
	{
		m_nFadeTime += (FADETIME / 60);

		//描画残り時間が尽きた場合、フラグを倒す
		if(m_nFadeTime <= 0)
		{
			m_bDrawFlg = false;
		}
	}
	
	//頂点カラーの設定
	m_aVertex[0].col = D3DCOLOR_RGBA(255,255,255,m_nFadeTime);
	m_aVertex[1].col = D3DCOLOR_RGBA(255,255,255,m_nFadeTime);
	m_aVertex[2].col = D3DCOLOR_RGBA(255,255,255,m_nFadeTime);
	m_aVertex[3].col = D3DCOLOR_RGBA(255,255,255,m_nFadeTime);
}

//---------------------------------------------------------------------------------------
//フラグを立てる
//---------------------------------------------------------------------------------------
void CFade::ChangeFlg(void)
{
	//フェードをするようにフラグを立てる
	m_bDrawFlg = true;
	//フェードまでの時間を設定する
	m_nFadeTime = FADETIME;

}