#include "MenuWindow_Back.h"
#include "TextureManager.h"

//---------------------------------------------------------------------------------------
//静的メンバ変数定義
//---------------------------------------------------------------------------------------
CMenuWindow_Back* CMenuWindow_Back::m_pMenuWindow_Back = NULL;

//---------------------------------------------------------------------------------------
//コンストラクタ
//---------------------------------------------------------------------------------------
CMenuWindow_Back::CMenuWindow_Back(void)
{
	//使用するテクスチャIDの設定
	m_nTextureID = TEXTURE_WHITE_TEXTURE;

	//描画フラグの初期化
	m_bDrawFlg = false;

	//位置情報の設定
	m_aVertex[0].pos = D3DXVECTOR3(SCREEN_WIDTH - 240.0f , 50.0f ,0.0f);
	m_aVertex[1].pos = D3DXVECTOR3(SCREEN_WIDTH -  10.0f , 50.0f ,0.0f);
	m_aVertex[2].pos = D3DXVECTOR3(SCREEN_WIDTH - 240.0f ,360.0f ,0.0f);
	m_aVertex[3].pos = D3DXVECTOR3(SCREEN_WIDTH -  10.0f ,360.0f ,0.0f);
}
//---------------------------------------------------------------------------------------
//デストラクタ
//---------------------------------------------------------------------------------------
CMenuWindow_Back::~CMenuWindow_Back(void)
{
	//描画フラグの初期化
	m_bDrawFlg = false;
}
//---------------------------------------------------------------------------------------
//実体の作成
//---------------------------------------------------------------------------------------
void CMenuWindow_Back::Create()
{
	//実体が存在していなければ作成
	if (!m_pMenuWindow_Back)
	{
		m_pMenuWindow_Back = new CMenuWindow_Back;
	}
}
//---------------------------------------------------------------------------------------
//実体の削除
//---------------------------------------------------------------------------------------
void CMenuWindow_Back::Delete()
{
	//実体があれば削除
	if (m_pMenuWindow_Back)
	{
		delete m_pMenuWindow_Back;
		m_pMenuWindow_Back = NULL;
	}
}
//---------------------------------------------------------------------------------------
//実体のポインタを渡す
//---------------------------------------------------------------------------------------
CMenuWindow_Back* CMenuWindow_Back::GetPointer()
{
	//念のため作成関数を呼ぶ
	Create();
	return m_pMenuWindow_Back;
}