#include "Operation.h"
#include "TextureManager.h"

//---------------------------------------------------------------------------------------
//静的メンバ変数定義
//---------------------------------------------------------------------------------------
COperation* COperation::m_pOperation = NULL;
//---------------------------------------------------------------------------------------
//コンストラクタ
//---------------------------------------------------------------------------------------
COperation::COperation(void)
{
	//使用するテクスチャIDの設定
	m_nTextureID = TEXTURE_OPERATION;

	//位置情報の設定
	m_aVertex[0].pos = D3DXVECTOR3(SCREEN_WIDTH - 240.0f , 365.0f ,0.0f);
	m_aVertex[1].pos = D3DXVECTOR3(SCREEN_WIDTH -  10.0f , 365.0f ,0.0f);
	m_aVertex[2].pos = D3DXVECTOR3(SCREEN_WIDTH - 240.0f ,SCREEN_HEIGHT - 5.0f ,0.0f);
	m_aVertex[3].pos = D3DXVECTOR3(SCREEN_WIDTH -  10.0f ,SCREEN_HEIGHT - 5.0f ,0.0f);
}
//---------------------------------------------------------------------------------------
//デストラクタ
//---------------------------------------------------------------------------------------
COperation::~COperation(void)
{
}
//---------------------------------------------------------------------------------------
//実体の作成
//---------------------------------------------------------------------------------------
void COperation::Create()
{
	//中身がなければ作成
	if (!m_pOperation)
	{
		m_pOperation = new COperation;
	}
}

//---------------------------------------------------------------------------------------
//実体の削除
//---------------------------------------------------------------------------------------
VOID COperation::Delete(void)
{
	//中身があれば削除
	if (m_pOperation)
	{
		delete m_pOperation;
		m_pOperation = NULL;
	}
}
//---------------------------------------------------------------------------------------
//実体のポインタを渡す
//---------------------------------------------------------------------------------------
COperation* COperation::GetPoiner()
{
	//念のため作成関数を呼ぶ
	Create();
	return m_pOperation;
}